title: SSL SNI Involves GoToMyPC
description: 'This rule reports on SSL sessions where the SNI (Server Name
Indication) involves a GoToMyPC domain. This query is a hunt, and filtering
will be required to notice interesting results. This Sigma query is designed
to accompany the Corelight Threat Hunting Guide, which can be found here:
https://www3.corelight.com/corelights-introductory-guide-to-threat-hunting-with-zeek-bro-logs'
author: Corelight
tags:
- attack.initial_access
- attack.T1133
- attack.t1133
logsource:
  product: zeek
  service: ssl
detection:
  condition: selection and not 1 of filter*
  selection:
    server_name|endswith: 'poll.gotomypc.com'
fields:
- id.orig_h
- id.resp_h
- id.resp_p
- server_name
falsepositive:
- 'Users browsing to poll.gotomypc.com via their browser, for any reason, will be
flagged by this. Additionally, some organizations allow or encourage the use of
GoToMyPC, based on organizational policy.'
level: low
